7767517
169 190
Input            input0                   0 1 input0
Convolution      317                      1 1 input0 317 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        324                      1 1 317 324 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 325                      1 1 324 325 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             327                      1 1 325 327
Split            splitncnn_0              1 2 327 327_splitncnn_0 327_splitncnn_1
Pooling          334                      1 1 327_splitncnn_1 334 0=1 4=1
Reshape          338                      1 1 334 338 0=16
InnerProduct     339                      1 1 338 339 0=8 1=1 2=128
ReLU             340                      1 1 339 340
InnerProduct     341                      1 1 340 341 0=16 1=1 2=128
HardSigmoid      346                      1 1 341 346 0=1.666667e-01 1=5.000000e-01
Reshape          354                      1 1 346 354 0=1 1=1 2=16
BinaryOp         355                      2 1 327_splitncnn_0 354 355 0=2
Convolution      356                      1 1 355 356 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      358                      1 1 356 358 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
ReLU             360                      1 1 358 360
ConvolutionDepthWise 361                      1 1 360 361 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             363                      1 1 361 363
Convolution      364                      1 1 363 364 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
Split            splitncnn_1              1 2 364 364_splitncnn_0 364_splitncnn_1
Convolution      366                      1 1 364_splitncnn_1 366 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
ReLU             368                      1 1 366 368
ConvolutionDepthWise 369                      1 1 368 369 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=792 7=88
ReLU             371                      1 1 369 371
Convolution      372                      1 1 371 372 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
BinaryOp         374                      2 1 364_splitncnn_0 372 374 0=0
Split            splitncnn_2              1 2 374 374_splitncnn_0 374_splitncnn_1
Convolution      375                      1 1 374_splitncnn_1 375 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        382                      1 1 375 382 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 383                      1 1 382 383 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
Split            splitncnn_3              1 2 383 383_splitncnn_0 383_splitncnn_1
Pooling          391                      1 1 383_splitncnn_1 391 0=1 4=1
Reshape          395                      1 1 391 395 0=96
InnerProduct     396                      1 1 395 396 0=24 1=1 2=2304
ReLU             397                      1 1 396 397
InnerProduct     398                      1 1 397 398 0=96 1=1 2=2304
HardSigmoid      403                      1 1 398 403 0=1.666667e-01 1=5.000000e-01
Reshape          411                      1 1 403 411 0=1 1=1 2=96
BinaryOp         412                      2 1 383_splitncnn_0 411 412 0=2
HardSwish        418                      1 1 412 418 0=1.666667e-01 1=5.000000e-01
Convolution      419                      1 1 418 419 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3840
Split            splitncnn_4              1 2 419 419_splitncnn_0 419_splitncnn_1
Convolution      421                      1 1 419_splitncnn_1 421 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        428                      1 1 421 428 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 429                      1 1 428 429 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
Split            splitncnn_5              1 2 429 429_splitncnn_0 429_splitncnn_1
Pooling          437                      1 1 429_splitncnn_1 437 0=1 4=1
Reshape          441                      1 1 437 441 0=240
InnerProduct     442                      1 1 441 442 0=64 1=1 2=15360
ReLU             443                      1 1 442 443
InnerProduct     444                      1 1 443 444 0=240 1=1 2=15360
HardSigmoid      449                      1 1 444 449 0=1.666667e-01 1=5.000000e-01
Reshape          457                      1 1 449 457 0=1 1=1 2=240
BinaryOp         458                      2 1 429_splitncnn_0 457 458 0=2
HardSwish        464                      1 1 458 464 0=1.666667e-01 1=5.000000e-01
Convolution      465                      1 1 464 465 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
BinaryOp         467                      2 1 419_splitncnn_0 465 467 0=0
Split            splitncnn_6              1 2 467 467_splitncnn_0 467_splitncnn_1
Convolution      468                      1 1 467_splitncnn_1 468 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        475                      1 1 468 475 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 476                      1 1 475 476 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
Split            splitncnn_7              1 2 476 476_splitncnn_0 476_splitncnn_1
Pooling          484                      1 1 476_splitncnn_1 484 0=1 4=1
Reshape          488                      1 1 484 488 0=240
InnerProduct     489                      1 1 488 489 0=64 1=1 2=15360
ReLU             490                      1 1 489 490
InnerProduct     491                      1 1 490 491 0=240 1=1 2=15360
HardSigmoid      496                      1 1 491 496 0=1.666667e-01 1=5.000000e-01
Reshape          504                      1 1 496 504 0=1 1=1 2=240
BinaryOp         505                      2 1 476_splitncnn_0 504 505 0=2
HardSwish        511                      1 1 505 511 0=1.666667e-01 1=5.000000e-01
Convolution      512                      1 1 511 512 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
BinaryOp         514                      2 1 467_splitncnn_0 512 514 0=0
Convolution      515                      1 1 514 515 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
HardSwish        522                      1 1 515 522 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 523                      1 1 522 523 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
Split            splitncnn_8              1 2 523 523_splitncnn_0 523_splitncnn_1
Pooling          531                      1 1 523_splitncnn_1 531 0=1 4=1
Reshape          535                      1 1 531 535 0=120
InnerProduct     536                      1 1 535 536 0=32 1=1 2=3840
ReLU             537                      1 1 536 537
InnerProduct     538                      1 1 537 538 0=120 1=1 2=3840
HardSigmoid      543                      1 1 538 543 0=1.666667e-01 1=5.000000e-01
Reshape          551                      1 1 543 551 0=1 1=1 2=120
BinaryOp         552                      2 1 523_splitncnn_0 551 552 0=2
HardSwish        558                      1 1 552 558 0=1.666667e-01 1=5.000000e-01
Convolution      559                      1 1 558 559 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
Split            splitncnn_9              1 2 559 559_splitncnn_0 559_splitncnn_1
Convolution      561                      1 1 559_splitncnn_1 561 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6912
HardSwish        568                      1 1 561 568 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 569                      1 1 568 569 0=144 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3600 7=144
Split            splitncnn_10             1 2 569 569_splitncnn_0 569_splitncnn_1
Pooling          577                      1 1 569_splitncnn_1 577 0=1 4=1
Reshape          581                      1 1 577 581 0=144
InnerProduct     582                      1 1 581 582 0=40 1=1 2=5760
ReLU             583                      1 1 582 583
InnerProduct     584                      1 1 583 584 0=144 1=1 2=5760
HardSigmoid      589                      1 1 584 589 0=1.666667e-01 1=5.000000e-01
Reshape          597                      1 1 589 597 0=1 1=1 2=144
BinaryOp         598                      2 1 569_splitncnn_0 597 598 0=2
HardSwish        604                      1 1 598 604 0=1.666667e-01 1=5.000000e-01
Convolution      605                      1 1 604 605 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6912
BinaryOp         607                      2 1 559_splitncnn_0 605 607 0=0
Split            splitncnn_11             1 2 607 607_splitncnn_0 607_splitncnn_1
Convolution      608                      1 1 607_splitncnn_1 608 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13824
HardSwish        615                      1 1 608 615 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 616                      1 1 615 616 0=288 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=7200 7=288
Split            splitncnn_12             1 2 616 616_splitncnn_0 616_splitncnn_1
Pooling          624                      1 1 616_splitncnn_1 624 0=1 4=1
Reshape          628                      1 1 624 628 0=288
InnerProduct     629                      1 1 628 629 0=72 1=1 2=20736
ReLU             630                      1 1 629 630
InnerProduct     631                      1 1 630 631 0=288 1=1 2=20736
HardSigmoid      636                      1 1 631 636 0=1.666667e-01 1=5.000000e-01
Reshape          644                      1 1 636 644 0=1 1=1 2=288
BinaryOp         645                      2 1 616_splitncnn_0 644 645 0=2
HardSwish        651                      1 1 645 651 0=1.666667e-01 1=5.000000e-01
Convolution      652                      1 1 651 652 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Convolution      654                      1 1 374_splitncnn_0 654 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
ReLU             656                      1 1 654 656
Convolution      657                      1 1 607_splitncnn_0 657 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
ReLU             659                      1 1 657 659
Convolution      660                      1 1 652 660 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
ReLU             662                      1 1 660 662
Split            splitncnn_13             1 3 662 662_splitncnn_0 662_splitncnn_1 662_splitncnn_2
Interp           679                      1 1 662_splitncnn_2 679 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         680                      2 1 659 679 680 0=0
Convolution      681                      1 1 680 681 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             683                      1 1 681 683
Split            splitncnn_14             1 3 683 683_splitncnn_0 683_splitncnn_1 683_splitncnn_2
Interp           700                      1 1 683_splitncnn_2 700 0=1 1=2.000000e+00 2=2.000000e+00
BinaryOp         701                      2 1 656 700 701 0=0
Convolution      702                      1 1 701 702 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             704                      1 1 702 704
Split            splitncnn_15             1 2 704 704_splitncnn_0 704_splitncnn_1
Convolution      705                      1 1 704_splitncnn_1 705 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      707                      1 1 704_splitncnn_0 707 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             709                      1 1 707 709
Split            splitncnn_16             1 2 709 709_splitncnn_0 709_splitncnn_1
Convolution      710                      1 1 709_splitncnn_1 710 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      712                      1 1 709_splitncnn_0 712 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             714                      1 1 712 714
Convolution      715                      1 1 714 715 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           717                      3 1 705 710 715 717 0=0
ReLU             718                      1 1 717 718
Convolution      719                      1 1 683_splitncnn_1 719 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      721                      1 1 683_splitncnn_0 721 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             723                      1 1 721 723
Split            splitncnn_17             1 2 723 723_splitncnn_0 723_splitncnn_1
Convolution      724                      1 1 723_splitncnn_1 724 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      726                      1 1 723_splitncnn_0 726 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             728                      1 1 726 728
Convolution      729                      1 1 728 729 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           731                      3 1 719 724 729 731 0=0
ReLU             732                      1 1 731 732
Convolution      733                      1 1 662_splitncnn_1 733 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      735                      1 1 662_splitncnn_0 735 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             737                      1 1 735 737
Split            splitncnn_18             1 2 737 737_splitncnn_0 737_splitncnn_1
Convolution      738                      1 1 737_splitncnn_1 738 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      740                      1 1 737_splitncnn_0 740 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             742                      1 1 740 742
Convolution      743                      1 1 742 743 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           745                      3 1 733 738 743 745 0=0
ReLU             746                      1 1 745 746
Convolution      s8                       1 1 718 s8 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      s16                      1 1 732 s16 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      s32                      1 1 746 s32 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
